\documentclass{../../slides-style}

\slidetitle{Введение, Си}{11.09.2024}

\begin{document}

    \begin{frame}[plain]
        \titlepage
    \end{frame}

    \begin{frame}
        \frametitle{Замечания по домашкам}
        \begin{itemize}
            \item Нужен содержательный main и пример использования
            \item Не используйте exit
            \begin{itemize}
                \item Механизм сигнализации об ошибке
            \end{itemize}
            \item Старайтесь, чтобы весь ввод-вывод был в main-е
            \item Старайтесь писать переиспользуемый код (будто ваши функции кому-то могут понадобиться), проектируйте для переиспользования
            \item Пожалуйста, не называйте массив \enquote{Arr}
        \end{itemize}
    \end{frame}

    \begin{frame}[fragile]{Указатели и aliasing}
        \begin{minted}{c}
void swap(int *left, int *right) {
    *left ^= *right;
    *right ^= *left;
    *left ^= *right;
}

int main(void) {
    int a = 1;
    swap(&a, &a);
    printf("%d\n", a);
}
        \end{minted}
    \end{frame}

    \begin{frame}
        \frametitle{Ещё задачи}
        \begin{enumerate}
            \item Укажите условия, при которых формулы ``$a + a - a$'' и ``$a + (a - a)$'' не эквивалентны.
            \item Поменять значения двух целочисленных переменных местами (без привлечения третьей переменной и файлов).
            \item Напишите программу, считающую количество нулевых элементов в массиве.
            \item Напишите программу, печатающую все простые числа, не превосходящие заданного числа.
            \item Заданы две строки: $S$ и $S_1$. Найдите количество вхождений $S_1$ в $S$ как подстроки.
            \item Дан массив целых чисел $x[1]...x[m+n]$, рассматриваемый как соединение двух его отрезков: начала $x[1]...x[m]$ длины $m$ и конца $x[m+1]...x[m+n]$ длины $n$. Не используя дополнительных массивов, переставить местами начало и конец.
        \end{enumerate}
    \end{frame}

\end{document}

